let questions = [
    {
        q: "Наименьшее натуральное число.",
        a1: "1: 2",
        a2: "2: 1",
        a3: "3: 0",
        a4: "4: 3",
        correct: 2
    },
    {
        q: "Как называется результат сложения?",
        a1: "1: Разность",
        a2: "2: Частное",
        a3: "3: Сумма",
        a4: "4: Произведение",
        correct: 3
    },
    {
        q: "Какого действия нет в математике?",
        a1: "1: Сложение",
        a2: "2: Умножение",
        a3: "3: Деление",
        a4: "4: Отнимание",
        correct: 4
    },
    {
        q: "Как называется дробь, у которой чис­литель меньше знаменателя?",
        a1: "1: Правильная",
        a2: "2: Неправильная",
        a3: "3: Обыкновенная",
        a4: "4: Десятичная",
        correct: 1
    },
    {
        q: "Сколько концов у трех с половиной палок?",
        a1: "1: 6",
        a2: "2: 8",
        a3: "3: 10",
        a4: "4: 7",
        correct: 2
    },
    {
        q: "Наука о решении уравнений называ­ется...",
        a1: "1: Математика",
        a2: "2: Алгебра",
        a3: "3: Геометрия",
        a4: "4: Арифметика",
        correct: 2
    },
    {
        q: "Один насос за 1 минуту выкачивает 1 т воды. За сколько минут пять таких насосов выкача­ют 5 т воды?",
        a1: "1: 5",
        a2: "2: 10",
        a3: "3: 1",
        a4: "4: 2",
        correct: 3
    },
    {
        q: "Какая цифра была введена в матема­тику последней?",
        a1: "1: 5",
        a2: "2: 0",
        a3: "3: 9",
        a4: "4: 1",
        correct: 2
    },
    {
        q: "Каким числом является сумма целых чисел?",
        a1: "1: Натуральным",
        a2: "2: Рациональным",
        a3: "3: Целым",
        a4: "4: Действительным",
        correct: 3
    },
    {
        q: "Какую единицу длины в русский быт ввел Петр I?",
        a1: "1: Миля",
        a2: "2: Фут",
        a3: "3: Верста",
        a4: "4: Аршин",
        correct: 2
    },
    {
        q: "В нашей квартире есть стенные часы с боем. Они отбивают полные часы и одним ударом полчаса. Сколько ударов делают в сутки эти часы?",
        a1: "1: 180",
        a2: "2: 150",
        a3: "3: 200",
        a4: "4: 100",
        correct: 1
    },
    {
        q: "Кто это сказал: «Математика при­водит в порядок неупорядоченное, вычеркивает глу­пости, фильтрует грязное, дает ясность стилю»?",
        a1: "1: Галилей",
        a2: "2: Декарт",
        a3: "3: Фабр",
        a4: "4: Бернулли",
        correct: 3
    },
    {
        q: "Как называются числа, записанные одними единицами?",
        a1: "1: Нечетные",
        a2: "2: Простые",
        a3: "3: Составные",
        a4: "4: Эквивалентные",
        correct: 4
    },
    {
        q: "Кто автор книги «Начала»?",
        a1: "1: Пифагор",
        a2: "2: Евклид",
        a3: "3: Лобачевский",
        a4: "4: Ломоносов",
        correct: 2
    },
    {
        q: "Единица измерения объема нефти",
        a1: "1: Унция",
        a2: "2: Тонна",
        a3: "3: Баррель",
        a4: "4: Карат",
        correct: 3
    }
]